{
  "recipes": [
    {
      "id": 1,
      "title": "Bacon Spinach Dip",
      "category": "Appetizer",
      "servings": "8 servings",
      "ingredients": "10 bacon slices, 1 oz. block softened cream cheese, 1/3 cup mayonnaise, 1/3 cup sour cream, 1 tsp garlic powder, 1 tsp paprika, 1lb frozen chopped spinach, 1 cup fresh parmesan, 1 cup shredded mozzarella, 1 baguette sliced and toasted ",
      "instructions": "Step 1- Preheat oven to 350°. In an 8 inches nonstick skillet over medium heat, cook bacon until crispy, 8 minutes. Drain on a paper towel-lined plate, then chop. Step 2- In a large bowl, stir together cream cheese, mayonnaise, sour cream, garlic powder, and paprika and season with salt and pepper. Fold in chopped spinach, bacon, Parmesan, and 3/4 cup of mozzarella. Step 3- Transfer dip to an 8 inches heatproof skillet and sprinkle with remaining 1/4 cup mozzarella. Bake until golden and bubbly, 25 to 30 minutes. Step 4- Serve with crostini.",
      "thumbnail": "1.jpg",
      "comments": [
        { "id": 1, "content": "Great recipe!" },
        { "id": 2, "content": "I love it!" }
      ]
    },
    {
      "id": 2,
      "title": "Cheese Ball Bites",
      "category": "Appetizer",
      "servings": "18 servings",
      "ingredients": "8 slices bacon, 1 1/2 (8-oz.) blocks cream cheese, softened,1 cup shredded cheddar, 1 tsp. garlic powder, 1 tsp. paprika, Kosher salt, Freshly ground black pepper, 1/3 cup freshly chopped chives, 1/3 cup finely chopped pecans, 18 pretzels sticks",
      "instructions": "Step 1- In a large nonstick skillet, cook bacon until crispy, 8 minutes. Drain on a paper towel-lined plate, then finely chop. Set aside. Step 2- Meanwhile, in a large bowl, stir together cream cheese, cheddar cheese, garlic powder, and paprika and season with salt and pepper. Use a cookie scoop to form mixture into 18 small balls and transfer to a parchment–lined baking sheet. Refrigerate until firm, 1 hour. Step 3- In a shallow bowl, stir together bacon, chives, and pecans. Step 4- Roll balls in bacon-chive-pecan mixture, insert a pretzel stick into each, and let come to room temperature 15 minutes before serving. (If not serving right away, loosely cover with plastic wrap and return to fridge.)",
      "thumbnail": "2.jpg",
      "comments": [
        { "id": 1, "content": "Flavor explosion!" },
        { "id": 2, "content": "Ridiculously tasty!" }
      ]
    },
    {
      "id": 3,
      "title": "Parmesan Bread Bites",
      "category": "Appetizer",
      "servings": "8 servings",
      "ingredients": "1 lb. store-bought or homemade pizza dough, 4 tbsp. (1/2 stick) unsalted butter, 3 cloves garlic, finely chopped, Kosher salt, All-purpose flour, for surface, 1 cup grated Parmesan (4 oz.), divided, plus more for serving, 1/4 cup shredded low-moisture part-skim mozzarella, 1 tbsp. chopped fresh sage, plus more for serving, 1 tbsp. chopped fresh thyme, plus more for serving, Hot honey, for drizzling (optional)",
      "instructions": "Step 1- Let pizza dough sit until room temperature if needed, about 1 hour. Step 2- Preheat oven to 400°. Line a large baking sheet with parchment. Step 3- In a small pot over low heat, melt butter. Add garlic and 1/2 teaspoon salt and cook, stirring often, until starting to froth, 4 to 6 minutes. Immediately remove pot from heat and let cool. Step 4- On a lightly floured surface, stretch dough to a 9inches square. Sprinkle with 1/2 cup Parmesan and gently press cheese into dough with your hands. Using a sharp knife or bench scraper, cut dough into 9 (1inch-wide) strips. Separate each strip to keep from sticking. Cut each strip crosswise into 1 inch pieces. Step 5- Arrange dough on prepared sheet in an even layer. Brush with about one-third of garlic butter. Sprinkle with mozzarella, sage, thyme, and remaining 1/2 cup Parmesan. Step 6- Bake bread bites until golden brown, 15 to 20 minutes. Immediately brush with remaining garlic butter. Top with more Parmesan, sage, and thyme. Drizzle with hot honey, if using.",
      "thumbnail": "3.jpg",
      "comments": [
        { "id": 1, "content": "Foolproof and fabulous." },
        { "id": 2, "content": "Impressed with ease and taste." }
      ]
    },
    {
      "id": 4,
      "title": "Apple Cheddar Bundles",
      "category": "Pastry",
      "servings": "8 servings",
      "ingredients": "2 medium Honeycrisp apples (about 1 1/4 lb.), cored, sliced 1/8inches thick, Zest from 1 lemon, 6 tbsp. honey, divided, 1 (17.3oz.) frozen package puff pastry, thawed, 1 large egg, 1 (8-oz.) block sharp cheddar, grated, 1 1/2 tsp. flaky sea salt, 1/4 cup chopped roasted pecans, 1 tsp. fresh thyme leaves",
      "instructions": "Step 1- Preheat oven to 400° and line 2 sheet trays with parchment. In a medium bowl, toss apples, lemon zest, and 4 tablespoons honey. Step 2- Cut each pastry sheet into 4 (4.5 inches x 4.5 inches) squares for a total of 8. In a small bowl, whisk egg with a splash of water. Brush outer edges of pastry with egg wash. Rotate pastry squares so a corner faces you. Place 1 tablespoon grated cheese on the bottom. Top with 10 to 11 apple slices. Place 1 tablespoon grated cheese on each side of apple slices. Fold left side over top and lightly press to seal. Fold right side over top and press to seal. Brush tops and sides of pastry with egg wash; sprinkle with sea salt. Arrange 4 pastries on each prepared tray. Step 3- Bake puffs, rotating trays halfway through, until pastry is puffed up and golden brown around the edges, 20 to 25 minutes. Let cool 5 minutes. Step 4- Arrange on a platter. Drizzle with remaining 2 tablespoons honey. Top with pecans and thyme.",
      "thumbnail": "4.jpg",
      "comments": [
        { "id": 1, "content": "Perfect balance of flavors." },
        { "id": 2, "content": "Speedy and scrumptious." }
      ]
    },
    {
      "id": 5,
      "title": "Buffalo Cauliflower",
      "category": "Side dish",
      "servings": "2 servings",
      "ingredients": "1 head of cauliflower (about 1 1/2 lb.), 3 tbsp. Frank’s RedHot Sauce, 2 tbsp. butter, melted, 1/2 tsp. kosher salt, 1/4 tsp. garlic powder, 1 tbsp. cornstarch",
      "instructions": "Step 1- Break head of cauliflower into same-sized florets. In a large bowl, stir hot sauce, butter, salt, and garlic powder. Add cauliflower; toss to combine. Add cornstarch, toss to coat. Step 2- Using tongs and working in batches if necessary to avoid overcrowding, place cauliflower in an air-fryer basket. Cook at 350°, tossing halfway through, until browned in spots, about 15 minutes.",
      "thumbnail": "5.jpg",
      "comments": [
        { "id": 1, "content": "Deliciously straightforward." },
        { "id": 2, "content": "Couldn't be happier, yum" }
      ]
    },
    {
      "id": 6,
      "title": "Pigs In A Blanket Wreath",
      "category": "Appetizer",
      "servings": "12 servings",
      "ingredients": "1 tube refrigerated crescent rolls, 24 mini hot dogs, 1/4 cup Dijon mustard, Egg wash, 2 tsp. poppy seeds, Rosemary sprigs (for decoration), Ketchup, for serving",
      "instructions": "Step 1- Preheat oven to 375° F. Line a large baking pan with parchment paper. Slice crescent rolls lengthwise into thirds. Brush all over with dijon mustard. Place a mini hot dog on the thick end of each triangle and roll up. Step 2- Arrange the pigs in a blanket, side by side, in a circle on the baking sheet. They should be touching! Brush with egg wash and sprinkle with salt and poppy seeds. Step 3- Bake for 15 to 20 minutes, until the crescents are golden. Let cool for at least 20 minutes. Step 4- Lay rosemary sprigs around the inside of the wreath and place a small bowl filled with ketchup in the center.",
      "thumbnail": "6.jpg",
      "comments": [
        { "id": 1, "content": "Great recipe!" },
        { "id": 2, "content": "I love it!" }
      ]
    },
    {
      "id": 7,
      "title": "Chicken Spaghetti",
      "category": "Dinner",
      "servings": "4 servings",
      "ingredients": "1 lb. spaghetti, 1 tbsp. extra-virgin olive oil, 1 yellow onion, chopped, 1 red bell pepper, seeds and ribs removed, chopped, 1 lb. boneless, skinless chicken breasts, cut into 1 inch pieces, Kosher salt, Freshly ground black pepper, 1/2 tsp. chili powder, 3 tbsp. unsalted butter, 3 tbsp. all-purpose flour, 2 c. whole milk, 1 c. low-sodium chicken broth, 2 1/2 c. shredded cheddar, divided, Chopped fresh parsley, for serving",
      "instructions": "Step 1- Preheat oven to 350°. In a large pot of boiling salted water, cook spaghetti, stirring occasionally, until al dente according to package instructions, about 7 minutes. Step 2- Meanwhile, in another large pot over medium heat, heat oil. Add onion and bell pepper and cook, stirring occasionally, until softened, about 7 minutes. Transfer to a plate. Step 3- Season chicken all over with salt, pepper, and chili powder. In same pot over medium-high heat, cook chicken, stirring occasionally, until golden brown, about 5 minutes. Transfer to another plate. Step 4- In same pot over medium heat, melt butter. Whisk in flour and cook, whisking constantly, until fragrant and combined, about 1 minute. Add milk and broth and cook, stirring occasionally, until thickened, about 5 minutes. Step 5- Stir in spaghetti, vegetables, chicken, and 1 1/2 cups cheddar. Transfer to a 13 inches x 9 inches baking dish. Top with remaining 1 cup cheese. Step 6- Bake chicken spaghetti until bubbly, about 45 minutes. Top with parsley.",
      "thumbnail": "7.jpg",
      "comments": [
        { "id": 1, "content": "Restaurant-quality at home" },
        { "id": 2, "content": "Weeknight go-to recipe" }
      ]
    },
    {
      "id": 8,
      "title": "Garlic prawn rice",
      "category": "Dinner",
      "servings": "4 servings",
      "ingredients": "350g rice, 4 tbsp olive oil, 4 garlic cloves, thinly sliced, 400g prawns, peeled and deveined, 1 lemon, zested and juiced, plus extra wedges or slices, to serve, 25g parsley, leaves finely chopped",
      "instructions": "STEP 1- Cook the rice following pack instructions and set aside. Meanwhile, heat 3 tbsp of the olive oil in a pan over a medium heat, then add the garlic and fry for 30 seconds until fragrant. Tip in the prawns and cook until they turn pink and are cooked through, around 2-3 mins on each side. STEP 2- Squeeze the lemon juice over the prawns, sprinkle with lemon zest and half the parsley, then stir to combine. STEP 3- Add the cooked rice to the pan along with the remaining olive oil. Toss to coat. Cook for 1 min, then season. Remove from the heat, top with the remaining parsley and serve with the extra lemon pieces for squeezing over.",
      "thumbnail": "8.jpg",
      "comments": [
        { "id": 1, "content": "Quick and delicious!" },
        { "id": 2, "content": "Easy to follow, turned out fantastic." }
      ]
    },
    {
      "id": 9,
      "title": "Sweet & sour chicken",
      "category": "Dinner",
      "servings": "4 servings",
      "ingredients": "9 tbsp tomato ketchup,3 tbsp malt vinegar, 4 tbsp dark muscovado sugar, 2 garlic cloves, crushed, 4 skinless and boneless chicken breast, cut into chunks, 1 small onion, roughly chopped, 2 red peppers, seeded and cut into chunks, 227g can pineapple pieces in juice, drained, 100g sugar snap peas, roughly sliced, handful salted, roasted cashew nuts, optional",
      "instructions": "STEP 1- In a large microwaveable dish, mix the ketchup, vinegar, sugar and garlic thoroughly with the chicken, onion and peppers. Microwave, uncovered, on high for 8-10 mins until the chicken is starting to cook and the sauce is sizzling. STEP 2- Stir in the pineapple pieces and sugar snap peas and return to the microwave for another 3-5 mins until the chicken is completely cooked. Leave to stand for a few minutes, then stir in the cashews, if using, and serve.",
      "thumbnail": "9.jpg",
      "comments": [
        { "id": 1, "content": "Family favorite, a definite keeper!" },
        { "id": 2, "content": "Simple ingredients, big flavor" }
      ]
    },
    {
      "id": 10,
      "title": "Raspberry Cheese Danish",
      "category": "Pastry",
      "servings": "8 servings",
      "ingredients": "4 ounces cream cheese, softened, 1/4 cup plus 1/2 cup confectioners' sugar, divided, 1 can (8 ounces) refrigerated crescent rolls, 1/2 cup seedless raspberry jam, 2 teaspoons 2% milk",
      "instructions": "In a small bowl, beat cream cheese and 1/4 cup confectioners' sugar until smooth. Unroll crescent dough and separate into 4 rectangles; seal perforations. Cut each rectangle in half, making 8 squares. Transfer squares to a parchment-lined baking sheet. Spread 1 tablespoon cream cheese mixture diagonally across each square. Top with 1 tablespoon jam. Bring 2 opposite corners of dough over filling; pinch together firmly to seal. Bake at 375° for 10-12 minutes or until golden brown. Combine milk and remaining 1/2 cup confectioners' sugar; drizzle over pastries. Serve warm. Refrigerate leftovers.",
      "thumbnail": "10.jpg",
      "comments": [
        { "id": 1, "content": "Total crowd-pleaser" },
        { "id": 2, "content": "Five stars, loved it!" }
      ]
    },
    {
      "id": 11,
      "title": "Chocolate Billionaires",
      "category": "Dessert",
      "servings": "30 servings",
      "ingredients": "1 package (14 ounces) caramels, 3 tablespoons water, 1-1/2 cups chopped pecans, 1 cup Rice Krispies, 3 cups milk chocolate chips, 1-1/2 teaspoons shortening",
      "instructions": "Line 2 baking sheets with waxed paper; grease the paper and set aside. In a large heavy saucepan, combine the caramels and water; cook and stir over low heat until smooth. Stir in pecans and cereal until coated. Drop by teaspoonfuls onto prepared pans. Refrigerate for 10 minutes or until firm. Meanwhile, in a microwave, melt chocolate chips and shortening; stir until smooth. Dip candy into chocolate, coating all sides; allow excess to drip off. Place on prepared pans. Refrigerate until set. Store in an airtight container.",
      "thumbnail": "11.jpg",
      "comments": [
        { "id": 1, "content": "Absolutely delicious, a must-try!" },
        { "id": 2, "content": "Quick and delicious!" }
      ]
    },
    {
      "id": 12,
      "title": "Banana Cereal Pops",
      "category": "Healthy Dessert",
      "servings": "8 servings",
      "ingredients": "3/4 cup strawberry yogurt, 2 cups Fruity Pebbles cereal, 4 medium bananas, peeled and cut crosswise in half, 8 wooden pop sticks",
      "instructions": "Place yogurt and cereal in separate shallow bowls. Insert pop sticks through cut side of bananas. Dip bananas in yogurt, then roll in cereal to coat. Transfer to waxed paper-lined baking sheets. Freeze until firm, about 1 hour. Transfer to airtight freezer containers; seal containers and return pops to freezer.",
      "thumbnail": "12.jpg",
      "comments": [
        { "id": 1, "content": "Satisfyingly simple." },
        { "id": 2, "content": "A winner in our house." }
      ]
    }
  ]
}